yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostnrg288a.h
/* Port 1 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CR2_0       : 1;
  unsigned char CR2_1       : 1;
  unsigned char CR2_2       : 1;
  unsigned char CR2_3       : 1;
  unsigned char CR2_4       : 1;
  unsigned char CR2_5       : 1;
  unsigned char CR2_6       : 1;
  unsigned char CR2_7       : 1;
} __BITS_P1_CR2;
#endif
__IO_REG8_BIT(P1_CR2,      0x5009, __READ_WRITE, __BITS_P1_CR2);


/*-------------------------------------------------------------------------
 *      Port 1 Registers bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define P1_ODR_ODR0              P1_ODR_bit.ODR0
#define P1_ODR_ODR1              P1_ODR_bit.ODR1
#define P1_ODR_ODR2              P1_ODR_bit.ODR2
#define P1_ODR_ODR3              P1_ODR_bit.ODR3
#define P1_ODR_ODR4              P1_ODR_bit.ODR4
#define P1_ODR_ODR5              P1_ODR_bit.ODR5
#define P1_ODR_ODR6              P1_ODR_bit.ODR6
#define P1_ODR_ODR7              P1_ODR_bit.ODR7

#define P1_IDR_IDR0              P1_IDR_bit.IDR0
#define P1_IDR_IDR1              P1_IDR_bit.IDR1
#define P1_IDR_IDR2              P1_IDR_bit.IDR2
#define P1_IDR_IDR3              P1_IDR_bit.IDR3
#define P1_IDR_IDR4              P1_IDR_bit.IDR4
#define P1_IDR_IDR5              P1_IDR_bit.IDR5
#define P1_IDR_IDR6              P1_IDR_bit.IDR6
#define P1_IDR_IDR7              P1_IDR_bit.IDR7

#define P1_DDR_DDR0              P1_DDR_bit.DDR0
#define P1_DDR_DDR1              P1_DDR_bit.DDR1
#define P1_DDR_DDR2              P1_DDR_bit.DDR2
#define P1_DDR_DDR3              P1_DDR_bit.DDR3
#define P1_DDR_DDR4              P1_DDR_bit.DDR4
#define P1_DDR_DDR5              P1_DDR_bit.DDR5
#define P1_DDR_DDR6              P1_DDR_bit.DDR6
#define P1_DDR_DDR7              P1_DDR_bit.DDR7

#define P1_CR1_CR1_0             P1_CR1_bit.CR1_0
#define P1_CR1_CR1_1             P1_CR1_bit.CR1_1
#define P1_CR1_CR1_2             P1_CR1_bit.CR1_2
#define P1_CR1_CR1_3             P1_CR1_bit.CR1_3
#define P1_CR1_CR1_4             P1_CR1_bit.CR1_4
#define P1_CR1_CR1_5             P1_CR1_bit.CR1_5
#define P1_CR1_CR1_6             P1_CR1_bit.CR1_6
#define P1_CR1_CR1_7             P1_CR1_bit.CR1_7

#define P1_CR2_CR2_0             P1_CR2_bit.CR2_0
#define P1_CR2_CR2_1             P1_CR2_bit.CR2_1
#define P1_CR2_CR2_2             P1_CR2_bit.CR2_2
#define P1_CR2_CR2_3             P1_CR2_bit.CR2_3
#define P1_CR2_CR2_4             P1_CR2_bit.CR2_4
#define P1_CR2_CR2_5             P1_CR2_bit.CR2_5
#define P1_CR2_CR2_6             P1_CR2_bit.CR2_6
#define P1_CR2_CR2_7             P1_CR2_bit.CR2_7

#endif

/*-------------------------------------------------------------------------
 *      Port 1 Registers bit masks
 *-----------------------------------------------------------------------*/
#define MASK_P1_ODR_ODR0         0x01
#define MASK_P1_ODR_ODR1         0x02
#define MASK_P1_ODR_ODR2         0x04
#define MASK_P1_ODR_ODR3         0x08
#define MASK_P1_ODR_ODR4         0x10
#define MASK_P1_ODR_ODR5         0x20
#define MASK_P1_ODR_ODR6         0x40
#define MASK_P1_ODR_ODR7         0x80

#define MASK_P1_IDR_IDR0         0x01
#define MASK_P1_IDR_IDR1         0x02
#define MASK_P1_IDR_IDR2         0x04
#define MASK_P1_IDR_IDR3         0x08
#define MASK_P1_IDR_IDR4         0x10
#define MASK_P1_IDR_IDR5         0x20
#define MASK_P1_IDR_IDR6         0x40
#define MASK_P1_IDR_IDR7         0x80

#define MASK_P1_DDR_DDR0         0x01
#define MASK_P1_DDR_DDR1         0x02
#define MASK_P1_DDR_DDR2         0x04
#define MASK_P1_DDR_DDR3         0x08
#define MASK_P1_DDR_DDR4         0x10
#define MASK_P1_DDR_DDR5         0x20
#define MASK_P1_DDR_DDR6         0x40
#define MASK_P1_DDR_DDR7         0x80

#define MASK_P1_CR1_CR1_0        0x01
#define MASK_P1_CR1_CR1_1        0x02
#define MASK_P1_CR1_CR1_2        0x04
#define MASK_P1_CR1_CR1_3        0x08
#define MASK_P1_CR1_CR1_4        0x10
#define MASK_P1_CR1_CR1_5        0x20
#define MASK_P1_CR1_CR1_6        0x40
#define MASK_P1_CR1_CR1_7        0x80

#define MASK_P1_CR2_CR2_0        0x01
#define MASK_P1_CR2_CR2_1        0x02
#define MASK_P1_CR2_CR2_2        0x04
#define MASK_P1_CR2_CR2_3        0x08
#define MASK_P1_CR2_CR2_4        0x10
#define MASK_P1_CR2_CR2_5        0x20
#define MASK_P1_CR2_CR2_6        0x40
#define MASK_P1_CR2_CR2_7        0x80


/*-------------------------------------------------------------------------
 *      MSC Registers register definitions
 *-----------------------------------------------------------------------*/
/* Control register for P0-0 input line */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char INT_LEV     : 1;
  unsigned char INT_SEL0    : 1;
  unsigned char INT_SEL1    : 1;
  unsigned char INT_ENB     : 1;
  unsigned char INT_TYPE    : 1;
} __BITS_MSC_CFGP00;
#endif
__IO_REG8_BIT(MSC_CFGP00,  0x5010, __READ_WRITE, __BITS_MSC_CFGP00);

/* Control register for P0-1 input line */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char INT_LEV     : 1;
  unsigned char INT_SEL0    : 1;
  unsigned char INT_SEL1    : 1;
  unsigned char INT_ENB     : 1;
  unsigned char INT_TYPE    : 1;
} __BITS_MSC_CFGP01;
#endif
__IO_REG8_BIT(MSC_CFGP01,  0x5011, __READ_WRITE, __BITS_MSC_CFGP01);

/* Control register for P0-2 input line */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char INT_LEV     : 1;
  unsigned char INT_SEL0    : 1;
  unsigned char INT_SEL1    : 1;
  unsigned char INT_ENB     : 1;
  unsigned char INT_TYPE    : 1;
} __BITS_MSC_CFGP02;
#endif
__IO_REG8_BIT(MSC_CFGP02,  0x5012, __READ_WRITE, __BITS_MSC_CFGP02);

/* Control register for P0-3 input line */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char INT_LEV     : 1;
  unsigned char INT_SEL0    : 1;
  unsigned char INT_SEL1    : 1;
  unsigned char INT_ENB     : 1;
  unsigned char INT_TYPE    : 1;
} __BITS_MSC_CFGP03;
#endif
__IO_REG8_BIT(MSC_CFGP03,  0x5013, __READ_WRITE, __BITS_MSC_CFGP03);

/* Control register for P0-4 input line */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char INT_LEV     : 1;
  unsigned char INT_SEL0    : 1;
  unsigned char INT_SEL1    : 1;
  unsigned char INT_ENB     : 1;
  unsigned char INT_TYPE    : 1;
} __BITS_MSC_CFGP04;
#endif
__IO_REG8_BIT(MSC_CFGP04,  0x5014, __READ_WRITE, __BITS_MSC_CFGP04);

/* Control register for P0-5 input line */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char INT_LEV     : 1;
  unsigned char INT_SEL0    : 1;
  unsigned char INT_SEL1    : 1;
  unsigned char INT_ENB     : 1;
  unsigned char INT_TYPE    : 1;
} __BITS_MSC_CFGP05;
#endif
__IO_REG8_BIT(MSC_CFGP05,  0x5015, __READ_WRITE, __BITS_MSC_CFGP05);

/* Control register for AUXTIM input line */
__IO_REG8    (MSC_CFGP15,  0x5036, __READ_WRITE);
/* Control register for P2-0 input line */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char INT_LEV     : 1;
  unsigned char INT_SEL0    : 1;
  unsigned char INT_SEL1    : 1;
  unsigned char INT_ENB     : 1;
  unsigned char INT_TYPE    : 1;
} __BITS_MSC_CFGP20;
#endif
__IO_REG8_BIT(MSC_CFGP20,  0x5016, __READ_WRITE, __BITS_MSC_CFGP20);

/* Control register for P2-1 input line */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char INT_LEV     : 1;
  unsigned char INT_SEL0    : 1;
  unsigned char INT_SEL1    : 1;
  unsigned char INT_ENB     : 1;
  unsigned char INT_TYPE    : 1;
} __BITS_MSC_CFGP21;
#endif
__IO_REG8_BIT(MSC_CFGP21,  0x5017, __READ_WRITE, __BITS_MSC_CFGP21);

/* Control register for P2-2 input line */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char INT_LEV     : 1;
  unsigned char INT_SEL0    : 1;
  unsigned char INT_SEL1    : 1;
  unsigned char INT_ENB     : 1;
  unsigned char INT_TYPE    : 1;
} __BITS_MSC_CFGP22;
#endif
__IO_REG8_BIT(MSC_CFGP22,  0x5018, __READ_WRITE, __BITS_MSC_CFGP22);

/* Control register for P2-3 input line */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char INT_LEV     : 1;
  unsigned char INT_SEL0    : 1;
  unsigned char INT_SEL1    : 1;
  unsigned char INT_ENB     : 1;
  unsigned char INT_TYPE    : 1;
} __BITS_MSC_CFGP23;
#endif
__IO_REG8_BIT(MSC_CFGP23,  0x5019, __READ_WRITE, __BITS_MSC_CFGP23);

