yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostnrg288a.h
/* Control register for P2-4 input line */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char INT_LEV     : 1;
  unsigned char INT_SEL0    : 1;
  unsigned char INT_SEL1    : 1;
  unsigned char INT_ENB     : 1;
  unsigned char INT_TYPE    : 1;
} __BITS_MSC_CFGP24;
#endif
__IO_REG8_BIT(MSC_CFGP24,  0x501A, __READ_WRITE, __BITS_MSC_CFGP24);

/* Control register for P2-5 input line */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char INT_LEV     : 1;
  unsigned char INT_SEL0    : 1;
  unsigned char INT_SEL1    : 1;
  unsigned char INT_ENB     : 1;
  unsigned char INT_TYPE    : 1;
} __BITS_MSC_CFGP25;
#endif
__IO_REG8_BIT(MSC_CFGP25,  0x501B, __READ_WRITE, __BITS_MSC_CFGP25);

/* Port 0 Status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char BIT_0_INT   : 1;
  unsigned char BIT_1_INT   : 1;
  unsigned char BIT_2_INT   : 1;
  unsigned char BIT_3_INT   : 1;
  unsigned char BIT_4_INT   : 1;
  unsigned char BIT_5_INT   : 1;
} __BITS_MSC_STSP0;
#endif
__IO_REG8_BIT(MSC_STSP0,   0x501C, __READ_WRITE, __BITS_MSC_STSP0);

/* AUXTIM status register */
__IO_REG8    (MSC_STSP1,   0x5037, __READ_WRITE);
/* Port 2 Status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char BIT_0_INT   : 1;
  unsigned char BIT_1_INT   : 1;
  unsigned char BIT_2_INT   : 1;
  unsigned char BIT_3_INT   : 1;
  unsigned char BIT_4_INT   : 1;
  unsigned char BIT_5_INT   : 1;
} __BITS_MSC_STSP2;
#endif
__IO_REG8_BIT(MSC_STSP2,   0x501D, __READ_WRITE, __BITS_MSC_STSP2);

/* Miscellaneous indirect address */
__IO_REG8    (MSC_IDXADD,  0x503C, __READ_WRITE);
/* Miscellaneous indirect data */
__IO_REG8    (MSC_IDXDAT,  0x503D, __READ_WRITE);
/* Port 2 inputs read register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DATA_IN     : 6;
} __BITS_MSC_INPP2;
#endif
__IO_REG8_BIT(MSC_INPP2,   0x501E, __READ, __BITS_MSC_INPP2);

/* Enable DACs, CP3 sel */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DAC0_EN     : 1;
  unsigned char DAC1_EN     : 1;
  unsigned char DAC2_EN     : 1;
  unsigned char DAC3_EN     : 1;
  unsigned char CP3_EN      : 1;
  unsigned char CP3_SEL     : 1;
  unsigned char             : 1;
  unsigned char DACBIAS_EN  : 1;
} __BITS_MSC_DACCTR;
#endif
__IO_REG8_BIT(MSC_DACCTR,  0x5020, __READ_WRITE, __BITS_MSC_DACCTR);

/* Four bit input value for DAC 0 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DAC_IN0     : 4;
} __BITS_MSC_DACIN0;
#endif
__IO_REG8_BIT(MSC_DACIN0,  0x5021, __READ_WRITE, __BITS_MSC_DACIN0);

/* Four bit input value for DAC 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DAC_IN1     : 4;
} __BITS_MSC_DACIN1;
#endif
__IO_REG8_BIT(MSC_DACIN1,  0x5022, __READ_WRITE, __BITS_MSC_DACIN1);

/* Four bit input value for DAC 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DAC_IN2     : 4;
} __BITS_MSC_DACIN2;
#endif
__IO_REG8_BIT(MSC_DACIN2,  0x5023, __READ_WRITE, __BITS_MSC_DACIN2);

/* Four bit input value for DAC 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DAC_IN3     : 4;
} __BITS_MSC_DACIN3;
#endif
__IO_REG8_BIT(MSC_DACIN3,  0x5024, __READ_WRITE, __BITS_MSC_DACIN3);

/* SMED0,1 global configuration reg */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SMED0_GLBCONF: 4;
  unsigned char SMED1_GLBCONF: 4;
} __BITS_MSC_SMDCFG01;
#endif
__IO_REG8_BIT(MSC_SMDCFG01, 0x5025, __READ_WRITE, __BITS_MSC_SMDCFG01);

/* SMED2,3 global configuration reg */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SMED2_GLBCONF: 4;
  unsigned char SMED3_GLBCONF: 4;
} __BITS_MSC_SMDCFG23;
#endif
__IO_REG8_BIT(MSC_SMDCFG23, 0x5026, __READ_WRITE, __BITS_MSC_SMDCFG23);

/* SMED4,5 global configuration reg */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SMED4_GLBCONF: 4;
  unsigned char SMED5_GLBCONF: 4;
} __BITS_MSC_SMDCFG45;
#endif
__IO_REG8_BIT(MSC_SMDCFG45, 0x5027, __READ_WRITE, __BITS_MSC_SMDCFG45);

/* Software events for all SMED */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SW0         : 1;
  unsigned char SW1         : 1;
  unsigned char SW2         : 1;
  unsigned char SW3         : 1;
  unsigned char SW4         : 1;
  unsigned char SW5         : 1;
} __BITS_MSC_SMSWEV;
#endif
__IO_REG8_BIT(MSC_SMSWEV,  0x5028, __READ_WRITE, __BITS_MSC_SMSWEV);

/* Unlock controls for SMED */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char USE_UNLOCK_01: 1;
  unsigned char USE_UNLOCK_23: 1;
  unsigned char USE_UNLOCK_45: 1;
  unsigned char UNLOCK_01   : 1;
  unsigned char UNLOCK_23   : 1;
  unsigned char UNLOCK_45   : 1;
} __BITS_MSC_SMULOCK;
#endif
__IO_REG8_BIT(MSC_SMULOCK, 0x5029, __READ_WRITE, __BITS_MSC_SMULOCK);

/* Connect Box selection for SMED0 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CONB_S0_00  : 1;
  unsigned char CONB_S0_01  : 1;
  unsigned char CONB_S0_10  : 1;
  unsigned char CONB_S0_11  : 1;
  unsigned char CONB_S0_20  : 1;
  unsigned char CONB_S0_21  : 1;
} __BITS_MSC_CBOXS0;
#endif
__IO_REG8_BIT(MSC_CBOXS0,  0x502A, __READ_WRITE, __BITS_MSC_CBOXS0);

/* Connect Box selection for SMED1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CONB_S1_00  : 1;
  unsigned char CONB_S1_01  : 1;
  unsigned char CONB_S1_10  : 1;
  unsigned char CONB_S1_11  : 1;
  unsigned char CONB_S1_20  : 1;
  unsigned char CONB_S1_21  : 1;
} __BITS_MSC_CBOXS1;
#endif
__IO_REG8_BIT(MSC_CBOXS1,  0x502B, __READ_WRITE, __BITS_MSC_CBOXS1);

/* Connect Box selection for SMED2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CONB_S2_00  : 1;
  unsigned char CONB_S2_01  : 1;
  unsigned char CONB_S2_10  : 1;
  unsigned char CONB_S2_11  : 1;
  unsigned char CONB_S2_20  : 1;
  unsigned char CONB_S2_21  : 1;
} __BITS_MSC_CBOXS2;
#endif
__IO_REG8_BIT(MSC_CBOXS2,  0x502C, __READ_WRITE, __BITS_MSC_CBOXS2);

/* Connect Box selection for SMED3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CONB_S3_00  : 1;
  unsigned char CONB_S3_01  : 1;
  unsigned char CONB_S3_10  : 1;
  unsigned char CONB_S3_11  : 1;
  unsigned char CONB_S3_20  : 1;
  unsigned char CONB_S3_21  : 1;
} __BITS_MSC_CBOXS3;
#endif
__IO_REG8_BIT(MSC_CBOXS3,  0x502D, __READ_WRITE, __BITS_MSC_CBOXS3);

